'======================================GIT====================================='
# это распределенная система контроля версий (это система, записывающая изменения в файл или набора файлов в ьечении времени). Предназначен для отслеживания и видения истории изменения файлов,  в вашем проекте

'=====================================GITHUB======================================'
# Это сайт куда я могу отправить все что находится на моем ноутбуке, чтобы другие люди могли просматривать мой код и мой прогресс, так же использовать код

'Репозиторий'
# хранлищие проекта

# 1.локальный (на ноутбуке)
# 2.удаленный ( на каком-то сервисе, который предоставляет репозиторий (GITHUB))
