'========================Циклы======================='
# Цикл это конструкция, который повторяет код несколько раз
# Есть 2 вида цикла
'1. for - цикл который работает с итерируемым объектом, этот цикл заканчивает работу когда доходит до последнего элемента итерируемого объекта'

'2. while - цикл, который работает до тех пор пока условие верное(True)'

'Итерируемый объект - это какая-то последовательность, например: [1,23, "hi", "makers", (123, True, 1, 5,), dict, set]'

'терация - процесс перебора итерируемого объекта (когда мы по очереди вытаскиваем элементы в последовательности)'

'===========Цикл FOR==============='

# list_ = [12, 'hi', True, None, [0,0,0]]
# for i in list_:
#     print(i)


# for letter in 'hello world':
#     print(letter)
# h
# e
# l
# l
# o
 
# w
# o
# r
# l
# d
    

'-----------------------------------------------------'
# for number in [ 4, 12, 4, 8, 9, -1]:
#     print(number * 2)

# list_ = [2, 12, 5, 3]
# for i in list_:
#     print(list_ ** 2)



'-----------------------------------------------------------------------'

# text = 'makers'
# for letter in text:
#     print(letter)

# list_ = [2, 5, 20, 10, 9, -1]

# for i in list_:
#     if i % 2 == 0:
#      print(i)


'============================================ЦИКЛ WHILE============================='
# n = 1
# while n < 10:
#     print(n)
#     n = n + 1

# n = 0
# while n:
#     print('hi')
#     n += 1

# Останавливет ващ код в треминале
# ctrl + c
# ctrl + z




'================================Ключевые слова в циклах========================'
# break - принудительная остановка цикла
# continue - опускает итерацию, продолжает с следующей итерации

# range() # генератор

# for i in range(1, 11):
#     if i == 3:
#         continue
#     print(i)

# for i in range(11):
#     if i == 2:
#         break
#     print(i)

# n = 1
# while n > 10:
#     if n == 2:
#         continue
#     print(n)


# n = 0
# while n > -10:
#     break
# print(n)

name_of_friends = ["Erbol", "Yzat", "Azat", "Igor", "Nurchik"]
for jigi in name_of_friends:
    print(jigi)


list_ = [1, 2, 3, 4, 5]
new_list = []
for num in list_:
    new_list.append(str(num))
    print(new_list)

